agent-widget/agent-widget/firmware/sdkconfig.defaults
# Common defaults shared by board and QEMU builds. AW-006 architecture
# (docs.local/operations/qemu-ota/codex-architecture.md) section 2.2.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
